ch32v307-asm-note.org
* CH32V307裸机汇编指南

** 寄存器手册

https://www.wch.cn/downloads/CH32FV2x_V3xRM_PDF.html

** 原厂的驱动代码

https://www.wch.cn/downloads/CH32V307EVT_ZIP.html

** 点亮一颗LED

假设LED灯在GPIO PB4引脚上

CH32V307的GPIO控制器的clock默认是关闭的.

打开GPIO控制器的clock:

#+BEGIN_SRC asm
	  .equ RCC_BASE, 0x40021000
	  .equ R32_RCC_APB2PCENR, 0x18
	  .equ IOPBEN, (1 << 3)
	  li t0, RCC_BASE
	  lw t1, R32_RCC_APB2PCENR(t0)
	  ori t1, t1, IOPBEN // enable PORTB clock
	  sw t1, R32_RCC_APB2PCENR(t0)
#+END_SRC

配置GPIO PB4为输出模式，并设置高电平:

#+BEGIN_SRC asm
	  .equ GPIOB_BASE, 0x40010C00
	  .equ R32_GPIO_CFGLR, 0x00
	  .equ R32_GPIO_OUTDR, 0x0C
	  li t0, GPIOB_BASE
	  lw t1, R32_GPIO_CFGLR(t0)
	  // PB4 output push pull 2Mhz
	  li t2, ~(0xF << 16) // clean mode bits
	  and t1, t1, t2
	  li t2, (0x1 << 16) // set mode
	  or t1, t1, t2
	  sw t1, R32_GPIO_CFGLR(t0)
	  lw t1, R32_GPIO_OUTDR(t0)
	  ori t1, t1, (1 << 4) // LED2 ON
	  sw t1, R32_GPIO_OUTDR(t0)
#+END_SRC

** SRAM的大小

CH32V307的SRAM大小是可以配置的, 默认为32KiB

如果不确定SRAM大小，可以先将sp寄存器设置在32KiB SRAM末尾位置:

0x7FFC + 4 / 1024 = 32

#+BEGIN_SRC asm
  li sp, 0x20007FFC
#+END_SRC

** 获取SYSCLK

默认开机使用HSI 8Mhz作为SYSCLK，之后可以切换到HSE和PLL

** 获取HBCLK

SYSCLK分频得到HBCLK
